'''
[Python 코드 작성시 유의 사항]
1. 들여쓰기를 반드시 사용해야 한다.
2. 대,소 문자를 구분하여 작성해야 한다.

[출력 함수 사용하기]
- "print" 함수 (코드 상의 내용을 출력하기 위해 사용)
- 내용을 출력하기 위해서는 "(쌍따옴표),'(홑따옴표)를 이용
- 기본 사용 형식 1번 : print("출력내용"), 2번 : print('출력내용')
- 출력내용이 길어질 경우 ;(세미콜론)을 이용하여 같은 라인에 코드를 작성
- print("내용"); print("출력")
- print함수와 연산처리를 같이 진행 할 수 있다.

[ 주석 사용하기 ]
: 코드를 작성 할 때는 반드시 주석을 활용 해야 한다.
: 주석은 해당 코드에 사용 된 변수 및 코드의 사용이유를 작성한다.
'''

# 한줄 주석 처리

'''
    여러줄 주석처리
    여러줄 주석처리
    여러줄 주석처리
'''

'''
# [예제.1]
print("Hello Python!")
print("안녕하세요.!")
print("내용"); print("출력")

# [문제.1]
# 본인의 인적 사항을 아래와 같이 출력 시키시오. 
# 저의 이름은 홍길동 입니다.
# 저의 나이는 20살 입니다.
# 주소는 산골자기 입니다.

print('저의 이름은 홍길동 입니다.')
print('저의 나이는 20살 입니다.')
print('주소는 산골짜기 입니다.')


# [예제.2]
print("10 + 20")
print(10 + 20)
print("10 - 20")
print(10 - 20)
print("10 * 20")
print(10 * 20)
print("10 / 20")
print(10 / 20)

# [ 문제.2 ] 아래와 같이 출력 시키시오. 
# ( 결과 값은 자동연산 되도록 하세요. )
# 12 + 54 = 66 입니다.
# 268 - 42 = 226 입니다.
# 2 * 23 = 46 입니다.
# 120 / 3 = 40.0 입니다.

print("12 + 54 =", 12+54)
print("268 - 42 =", 268 - 42, "입니다.")
print("2 * 23 =", 2* 23)
print("120 / 3 =", 120 / 3, "입니다.")

# [예제.3]
print("내용\n출력")
print("안\n녕\n하\n세\n\n\n요")

print("안녕하세요\t반갑습니다")
print("Hello\t\tPython")
'''

